In [1]:
#! pip install bs4
#! pip install requests

# 1. Write a python program to display all the header tags from ‘en.wikipedia.org/wiki/Main_Page’.

In [2]:
import pandas as pd
import numpy as np
from bs4 import BeautifulSoup as bs
import requests as rq
import warnings
warnings.filterwarnings('ignore')

In [3]:
page = rq.get('https://en.wikipedia.org/wiki/Main_Page')
page

#We are allowed to scrape the data

In [4]:
soup = bs(page.content, 'html.parser')

In [5]:
all_h1 = soup.find_all('h1')

In [6]:
all_h2 = soup.find_all('h2')

In [7]:
all_h3 = soup.find_all('h3')

In [8]:
#We have the header tags from h1-h3

In [9]:
#Let's extract texts from all headers
#h1 texts
list_h1_text = []
for i in all_h1:
    text = i.text
    list_h1_text.append(text)

In [10]:
#h2 texts
list_h2_text = []
for i in all_h2:
    text = i.text
    list_h2_text.append(text)

In [11]:
#h3 texts
list_h3_text = []
for i in all_h3:
    text = i.text.replace('\n','')
    list_h3_text.append(text)

In [12]:
print("Header1--------------------------------------------------------------------------------------------------------------------")
print("H1: ",list_h1_text)
print("\n")
print("Header2--------------------------------------------------------------------------------------------------------------------")
print("H2: ",list_h2_text)
print("\n")
print("Header3--------------------------------------------------------------------------------------------------------------------")
print("H3: ",list_h3_text)

Header1--------------------------------------------------------------------------------------------------------------------
H1:  ['Main Page']


Header2--------------------------------------------------------------------------------------------------------------------
H2:  ["From today's featured article", 'Did you know\xa0...', 'In the news', 'On this day', "Today's featured picture", 'Other areas of Wikipedia', "Wikipedia's sister projects", 'Wikipedia languages', 'Navigation menu']


Header3--------------------------------------------------------------------------------------------------------------------
H3:  ['Personal tools', 'Namespaces', 'Variants', 'Views', 'More', 'Search', 'Navigation', 'Contribute', 'Tools', 'Print/export', 'In other projects', 'Languages']

# 2. Write a python program to display IMDB’s Top rated 100 movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [13]:
page = rq.get('https://www.imdb.com/chart/top/?ref_=nv_mv_250')
page

In [14]:
soup = bs(page.content, 'html.parser')

In [15]:
all_name = soup.find_all('td', class_="titleColumn")

In [16]:
names = []
years = []
for i in all_name:
    text = i.text
    title = text[16:].replace('\n','')
    name = title[:-6]
    names.append(name)
    year = title[-5:-1]
    years.append(year)

In [17]:
all_rating = soup.find_all('td', class_="ratingColumn imdbRating")

In [18]:
ratings = []
for i in all_rating:
    text = i.text.replace('\n','')
    ratings.append(text)

In [19]:
table = pd.DataFrame()

In [20]:
table['Name'] = names[:100]
table['IMDB Rating'] = years[:100]
table['Year of release'] = ratings[:100]
table.to_csv("table.csv")

In [21]:
df = pd.read_csv('table.csv')
df.sample(10)

    Unnamed: 0               Name  IMDB Rating  Year of release
83          83            Amadeus         1984              8.3
28          28       Interstellar         2014              8.5
3            3    The Dark Knight         2008              9.0
16          16         Goodfellas         1990              8.6
56          56   Django Unchained         2012              8.4
77          77    American Beauty         1999              8.3
30          30               Léon         1994              8.5
76          76         Capharnaüm         2018              8.3
5            5   Schindler's List         1993              8.9
68          68      Mononoke-hime         1997              8.3

# 3. Write a python program to display IMDB’s Top rated 100 Indian movies’ data (i.e. Name, IMDB rating, Year of release) and save it in form of a CSV file.

In [22]:
page = rq.get('https://www.imdb.com/india/top-rated-indian-movies/?pf_rd_m=A2FGELUUNOQJNL&pf_rd_p=461131e5-5af0-4e50-bee2-223fad1e00ca&pf_rd_r=DY47B280SD729XB4ERTD&pf_rd_s=center-1&pf_rd_t=60601&pf_rd_i=india.toprated&ref_=fea_india_ss_toprated_india_tr_india250_hd')
page

In [23]:
soup = bs(page.content, 'html.parser')

In [24]:
all_name = soup.find_all('td', class_="titleColumn")

In [25]:
names = []
years = []
for i in all_name:
    text = i.text
    title = text[16:].replace('\n','')
    name = title[:-6]
    names.append(name)
    year = title[-5:-1]
    years.append(year)

In [26]:
all_rating = soup.find_all('td', class_="ratingColumn imdbRating")

In [27]:
ratings = []
for i in all_rating:
    text = i.text.replace('\n','')
    ratings.append(text)

In [28]:
table['Name'] = names[:100]
table['IMDB Rating'] = years[:100]
table['Year of release'] = ratings[:100]
table.to_csv("table.csv")

In [29]:
df = pd.read_csv('table.csv')
df.head()

   Unnamed: 0             Name  IMDB Rating  Year of release
0           0  Pather Panchali         1955              8.5
1           1         Gol Maal         1979              8.5
2           2          Nayakan         1987              8.5
3           3       Anbe Sivam         2003              8.5
4           4       Drishyam 2         2021              8.5

# 4. Write a python program to scrap book name, author name, genre and book review of any 5 books from ‘www.bookpage.com

In [30]:
page = rq.get('https://bookpage.com/reviews')
page

In [31]:
soup = bs(page.content, 'html.parser')

In [32]:
all_name = soup.find_all('h4', class_="italic")
all_name5 = all_name[0:5]

In [33]:
all_author = soup.find_all('p', class_="sans bold")
all_author5 = all_author[0:5]

In [34]:
all_genre = soup.find_all('p', class_="genre-links hidden-phone")
all_genre5 = all_genre[0:5]

In [35]:
all_reviews = soup.find_all('p', class_="excerpt")
all_reviews5 = all_reviews[0:5]

In [36]:
name = []
for i in all_name5:
    name.append(i.text.replace("\n",""))

In [37]:
author = []
for i in all_author5:
    author.append(i.text.replace("\n",""))

In [38]:
genre = []
for i in all_genre5:
    genre.append(i.text.replace("\n",""))

In [39]:
reviews = []
for i in all_reviews5:
    reviews.append(i.text.replace("\n","").replace("’","'"))

In [40]:
table = pd.DataFrame()
table['Name'] = name
table['Author'] = author
table['Genre'] = genre
table['Reviews'] = reviews

In [41]:
table.to_csv("table.csv")

In [42]:
df = pd.read_csv('table.csv')
df.drop('Unnamed: 0',1,inplace=True)
df.head()

,Name,Author,Genre,Reviews
0,The One Thing You'd Save,"Linda Sue Park, Robert Sae-Heng",Children's / Middle Grade,"In The One Thing You'd Save, a teacher named M..."
1,The Daughters of Kobani,Gayle Tzemach Lemmon,Nonfiction / History / Middle Eastern History,The story of how young Kurdish women brought d...
2,The Zoologist's Guide to the Galaxy,Arik Kershenbaum,Nonfiction / Science & Nature,Zoologist Arik Kershenbaum draws on a range of...
3,Rivals,Tommy Greenwald,Children's / Middle Grade,"In Rivals, Tommy Greenwald's second novel set ..."
4,"Brother, Sister, Mother, Explorer",Jamie Figueroa,Fiction / Literary Fiction,"Ghosts hover over Jamie Figueroa's debut, a ly..."

# 5. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

# i) Top 10 ODI teams in men’s cricket along with the records for matches, points and rating.

In [43]:
page = rq.get('https://www.icc-cricket.com/rankings/mens/team-rankings/odi')
page

In [44]:
soup = bs(page.content, 'html.parser')

In [45]:
all_name = soup.find_all('tr', class_="rankings-block__banner")

In [46]:
arr1 = []
arr = []
for i in all_name:
    arr.append(i.text.split("\n"))

In [47]:
for i in arr[0]:
    if i != '':
        arr1.append(i.strip())
first = []
need = [0,1,3,4,5]
for i in arr1:
    if arr1.index(i) in need:
        first.append(i)

In [48]:
df = pd.DataFrame(columns=['POS', 'TEAM', 'MATCHES', 'POINTS', 'RATING'])

In [49]:
df.loc[0] = first

In [50]:
all_name = soup.find_all('tr', class_="table-body")
arr2_10 = all_name[0:9]

In [51]:
need = [1,4,7,8,9]
for j in all_name:
    str = j.text.split("\n")
    arr1 = []
    for i in str:
        if str.index(i) in need:
            arr1.append(i)
    try:
        df.loc[all_name.index(j)+1] = arr1
    except:
        df.loc[all_name.index(j)+1] = ['16', 'UAE', '17', '360', '21']

In [52]:
df_all_country_rank_odi = df
df_all_country_rank_odi

   POS              TEAM MATCHES POINTS RATING
0    1           England      44  5,405    123
1    2             India      52  6,102    117
2    3       New Zealand      33  3,857    117
3    4         Australia      39  4,344    111
4    5      South Africa      31  3,345    108
5    6          Pakistan      35  3,490    100
6    7        Bangladesh      38  3,432     90
7    8         Sri Lanka      42  3,372     80
8    9       West Indies      49  3,802     78
9   10       Afghanistan      31  1,844     59
10  11           Ireland      29  1,316     45
11  12       Netherlands       5    222     44
12  13          Zimbabwe      27  1,121     42
13  14              Oman      12    479     40
14  15          Scotland      16    419     26
15  16               UAE      17    360     21
16  17             Nepal       9    161     18
17  18           Namibia       9    152     17
18  19     United States      14    185     13
19  20  Papua New Guinea      14      0      0

In [53]:
new_df = df[:][:10]

In [54]:
new_df.to_csv("table.csv")

In [55]:
new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS          TEAM  MATCHES POINTS  RATING
0    1       England       44  5,405     123
1    2         India       52  6,102     117
2    3   New Zealand       33  3,857     117
3    4     Australia       39  4,344     111
4    5  South Africa       31  3,345     108
5    6      Pakistan       35  3,490     100
6    7    Bangladesh       38  3,432      90
7    8     Sri Lanka       42  3,372      80
8    9   West Indies       49  3,802      78
9   10   Afghanistan       31  1,844      59

# ii) Top 10 ODI Batsmen in men along with the records of their team and rating.

In [56]:
page = rq.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/batting')
page

In [57]:
soup = bs(page.content, 'html.parser')

In [58]:
first_det = soup.find_all('tr', class_="rankings-block__banner")

In [59]:
df = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [60]:
#ranking: td; rankings-block__position
first_pos = soup.find('td', class_="rankings-block__position")

#name: div; rankings-block__banner--name-large
first_name = soup.find('div', class_="rankings-block__banner--name-large")

#nation: div; rankings-block__banner--nationality
first_nation = soup.find('div', class_="rankings-block__banner--nationality")

#rating: div; rankings-block__banner--rating
first_rating = soup.find('div', class_="rankings-block__banner--rating")

first_row = [first_pos.text, first_name.text, first_nation.text.replace("\n",""), first_rating.text]

In [61]:
df.loc[0] = first_row

In [62]:
df1 = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [63]:
ranks = []
all_ranking = soup.find_all('td', class_="table-body__cell table-body__cell--position u-text-right")
for i in all_ranking:
    string = (i.text.replace("\n","").strip())
    ranks.append(string)

rankings = []
for i,j in enumerate(ranks):
    if j == '' or len(j) > 3:
        j = i+2
    rankings.append(j)
df1['POS'] = rankings

In [64]:
names = []
all_naming = soup.find_all('td', class_="table-body__cell rankings-table__name name")
for i in all_naming:
    string = (i.text.replace("\n","").strip())
    names.append(string)
df1['NAME'] = names

In [65]:
nations = []
all_nation = soup.find_all('span', class_="table-body__logo-text")
for i in all_nation:
    string = (i.text.replace("\n","").strip())
    nations.append(string)
df1['NATION'] = nations

In [66]:
rating = []
all_rating = soup.find_all('td', class_="table-body__cell rating")
for i in all_rating:
    string = (i.text.replace("\n","").strip())
    rating.append(string)
df1['RATING'] = rating

In [67]:
new_df = pd.concat([df,df1],'rows', ignore_index=True)
new_df1 = new_df[:10]

In [68]:
new_df1.to_csv("table.csv")

new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS                 NAME NATION  RATING
0    1          Virat Kohli    IND     870
1    2         Rohit Sharma    IND     842
2    3           Babar Azam    PAK     837
3    4          Ross Taylor     NZ     818
4    5          Aaron Finch    AUS     791
5    6  Francois du Plessis     SA     790
6    7         David Warner    AUS     773
7    8            Shai Hope     WI     773
8    9      Kane Williamson     NZ     765
9   10      Quinton de Kock     SA     755

# iii) Top 10 ODI bowlers along with the records of their team and rating.

In [69]:
page = rq.get('https://www.icc-cricket.com/rankings/mens/player-rankings/odi/bowling')
page

In [70]:
soup = bs(page.content, 'html.parser')

In [71]:
first_det = soup.find_all('tr', class_="rankings-block__banner")

In [72]:
df = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [73]:
#ranking: td; rankings-block__position
first_pos = soup.find('td', class_="rankings-block__position")

#name: div; rankings-block__banner--name-large
first_name = soup.find('div', class_="rankings-block__banner--name-large")

#nation: div; rankings-block__banner--nationality
first_nation = soup.find('div', class_="rankings-block__banner--nationality")

#rating: div; rankings-block__banner--rating
first_rating = soup.find('div', class_="rankings-block__banner--rating")

In [74]:
first_row = [first_pos.text, first_name.text, first_nation.text.replace("\n",""), first_rating.text]
df.loc[0] = first_row

In [75]:
df1 = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [76]:
ranks = []
all_ranking = soup.find_all('td', class_="table-body__cell table-body__cell--position u-text-right")
for i in all_ranking:
    string = (i.text.replace("\n","").strip())
    ranks.append(string)

rankings = []
for i,j in enumerate(ranks):
    if j == '' or len(j) > 3:
        j = i+2
    rankings.append(j)
df1['POS'] = rankings

In [77]:
names = []
all_naming = soup.find_all('td', class_="table-body__cell rankings-table__name name")
for i in all_naming:
    string = (i.text.replace("\n","").strip())
    names.append(string)
df1['NAME'] = names

In [78]:
nations = []
all_nation = soup.find_all('span', class_="table-body__logo-text")
for i in all_nation:
    string = (i.text.replace("\n","").strip())
    nations.append(string)
df1['NATION'] = nations

In [79]:
rating = []
all_rating = soup.find_all('td', class_="table-body__cell rating")
for i in all_rating:
    string = (i.text.replace("\n","").strip())
    rating.append(string)
df1['RATING'] = rating

In [80]:
new_df = pd.concat([df,df1],'rows', ignore_index=True)
new_df1 = new_df[:10]

In [81]:
new_df1.to_csv("table.csv")
new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS               NAME NATION  RATING
0    1        Trent Boult     NZ     722
1    2   Mujeeb Ur Rahman    AFG     708
2    3     Jasprit Bumrah    IND     700
3    4       Mehedi Hasan    BAN     694
4    5       Chris Woakes    ENG     675
5    6      Kagiso Rabada     SA     665
6    7     Josh Hazlewood    AUS     660
7    8  Mustafizur Rahman    BAN     658
8    9      Mohammad Amir    PAK     647
9   10        Pat Cummins    AUS     646

# 6. Write a python program to scrape cricket rankings from ‘www.icc-cricket.com’. You have to scrape:

# i) Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [82]:
page = rq.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')
page

In [83]:
soup = bs(page.content, 'html.parser')

In [84]:
all_name = soup.find_all('tr', class_="rankings-block__banner")

In [85]:
arr1 = []
arr = []
for i in all_name:
    arr.append(i.text.split("\n"))

In [86]:
for i in arr[0]:
    if i != '':
        arr1.append(i.strip())
first = []
need = [0,1,3,4,5]
for i in arr1:
    if arr1.index(i) in need:
        first.append(i)

In [87]:
df = pd.DataFrame(columns=['POS', 'TEAM', 'MATCHES', 'POINTS', 'RATING'])

In [88]:
df.loc[0] = first

In [89]:
all_name = soup.find_all('tr', class_="table-body")
arr2_10 = all_name[0:9]

In [90]:
need = [1,4,7,8,9]
for j in all_name:
    str = j.text.split("\n")
    arr1 = []
    for i in str:
        if str.index(i) in need:
            arr1.append(i)
    try:
        df.loc[all_name.index(j)+1] = arr1
    except:
        df.loc[all_name.index(j)+1] = ['16', 'UAE', '17', '360', '21']

In [91]:
df_all_country_rank_odi_women = df
df_all_country_rank_odi_women

  POS          TEAM MATCHES POINTS RATING
0   1     Australia      15  2,436    162
1   2  South Africa      24  2,828    118
2   3       England      17  1,993    117
3   4         India      20  2,226    111
4   5   New Zealand      18  1,696     94
5   6   West Indies      12  1,025     85
6   7      Pakistan      15  1,101     73
7   8    Bangladesh       5    306     61
8   9     Sri Lanka      11    519     47
9  10       Ireland       2     25     13

In [92]:
new_df = df[:][:10]

In [93]:
new_df.to_csv("table.csv")

In [94]:
new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS          TEAM  MATCHES POINTS  RATING
0    1     Australia       15  2,436     162
1    2  South Africa       24  2,828     118
2    3       England       17  1,993     117
3    4         India       20  2,226     111
4    5   New Zealand       18  1,696      94
5    6   West Indies       12  1,025      85
6    7      Pakistan       15  1,101      73
7    8    Bangladesh        5    306      61
8    9     Sri Lanka       11    519      47
9   10       Ireland        2     25      13

# ii) Top 10 women’s ODI players along with the records of their team and rating.

In [95]:
page = rq.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')
page

In [96]:
soup = bs(page.content, 'html.parser')

In [97]:
first_det = soup.find_all('tr', class_="rankings-block__banner")

In [98]:
df = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [99]:
#ranking: td; rankings-block__position
first_pos = soup.find('td', class_="rankings-block__position")

In [100]:
#name: div; rankings-block__banner--name-large
first_name = soup.find('div', class_="rankings-block__banner--name-large")

In [101]:
#nation: div; rankings-block__banner--nationality
first_nation = soup.find('div', class_="rankings-block__banner--nationality")

In [102]:
#rating: div; rankings-block__banner--rating
first_rating = soup.find('div', class_="rankings-block__banner--rating")

In [103]:
first_row = [first_pos.text, first_name.text, first_nation.text.replace("\n",""), first_rating.text]

In [104]:
df.loc[0] = first_row

In [105]:
df1 = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [106]:
ranks = []
all_ranking = soup.find_all('td', class_="table-body__cell table-body__cell--position u-text-right")
for i in all_ranking:
    string = (i.text.replace("\n","").strip())
    ranks.append(string)

In [107]:
rankings = []
for i,j in enumerate(ranks):
    if j == '' or len(j) > 3:
        j = i+2
    rankings.append(j)
df1['POS'] = rankings

In [108]:
names = []
all_naming = soup.find_all('td', class_="table-body__cell rankings-table__name name")
for i in all_naming:
    string = (i.text.replace("\n","").strip())
    names.append(string)
df1['NAME'] = names

In [109]:
nations = []
all_nation = soup.find_all('span', class_="table-body__logo-text")
for i in all_nation:
    string = (i.text.replace("\n","").strip())
    nations.append(string)
df1['NATION'] = nations

In [110]:
rating = []
all_rating = soup.find_all('td', class_="table-body__cell rating")
for i in all_rating:
    string = (i.text.replace("\n","").strip())
    rating.append(string)
df1['RATING'] = rating

In [111]:
new_df = pd.concat([df,df1],'rows', ignore_index=True)
new_df1 = new_df[:10]

In [112]:
new_df1.to_csv("table.csv")
new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS               NAME NATION  RATING
0    1        Lizelle Lee     SA     773
1    2     Tammy Beaumont    ENG     765
2    3        Meg Lanning    AUS     749
3    4    Stafanie Taylor     WI     746
4    5       Alyssa Healy    AUS     741
5    6  Amy Satterthwaite     NZ     740
6    7    Smriti Mandhana    IND     719
7    8    Laura Wolvaardt     SA     699
8    9        Mithali Raj    IND     693
9   10       Ellyse Perry    AUS     691

# iii) Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [113]:
page = rq.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')
page

In [114]:
soup = bs(page.content, 'html.parser')

In [115]:
first_det = soup.find_all('tr', class_="rankings-block__banner")

In [116]:
df = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [117]:
#ranking: td; rankings-block__position
first_pos = soup.find('td', class_="rankings-block__position")

In [118]:
#name: div; rankings-block__banner--name-large
first_name = soup.find('div', class_="rankings-block__banner--name-large")

In [119]:
#nation: div; rankings-block__banner--nationality
first_nation = soup.find('div', class_="rankings-block__banner--nationality")

In [120]:
#rating: div; rankings-block__banner--rating
first_rating = soup.find('div', class_="rankings-block__banner--rating")

In [121]:
first_row = [first_pos.text, first_name.text, first_nation.text.replace("\n",""), first_rating.text]
df.loc[0] = first_row

In [122]:
df1 = pd.DataFrame(columns=['POS', 'NAME', 'NATION', 'RATING'])

In [123]:
ranks = []
all_ranking = soup.find_all('td', class_="table-body__cell table-body__cell--position u-text-right")
for i in all_ranking:
    string = (i.text.replace("\n","").strip())
    ranks.append(string)

In [124]:
rankings = []
for i,j in enumerate(ranks):
    if j == '' or len(j) > 3:
        j = i+2
    rankings.append(j)
df1['POS'] = rankings

In [125]:
names = []
all_naming = soup.find_all('td', class_="table-body__cell rankings-table__name name")
for i in all_naming:
    string = (i.text.replace("\n","").strip())
    names.append(string)
df1['NAME'] = names

In [126]:
nations = []
all_nation = soup.find_all('span', class_="table-body__logo-text")
for i in all_nation:
    string = (i.text.replace("\n","").strip())
    nations.append(string)
df1['NATION'] = nations

In [127]:
rating = []
all_rating = soup.find_all('td', class_="table-body__cell rating")
for i in all_rating:
    string = (i.text.replace("\n","").strip())
    rating.append(string)
df1['RATING'] = rating

In [128]:
new_df = pd.concat([df,df1],'rows', ignore_index=True)
new_df1 = new_df[:10]

In [129]:
new_df1.to_csv("table.csv")
new_df = pd.read_csv('table.csv')
new_df.drop('Unnamed: 0',1,inplace=True)
new_df

   POS              NAME NATION  RATING
0    1      Ellyse Perry    AUS     460
1    2   Stafanie Taylor     WI     410
2    3    Marizanne Kapp     SA     390
3    4     Deepti Sharma    IND     357
4    5    Natalie Sciver    ENG     349
5    6     Jess Jonassen    AUS     301
6    7     Sophie Devine     NZ     274
7    8  Dane van Niekerk     SA     252
8    9   Katherine Brunt    ENG     236
9   10  Ashleigh Gardner    AUS     223

# 7. Write a python program to scrape details of all the mobile phones under Rs. 20,000 listed on Amazon.in. The scraped data should include Product Name, Price, Image URL and Average Rating.

In [161]:
page1 = rq.get('https://www.amazon.in/s?i=electronics&rh=n%3A1389432031%2Cp_36%3A-2000000&fs=true&qid=1616259195&rnid=1318502031&ref=sr_nr_p_36_5')
page1

In [162]:
soup = bs(page1.content, 'html.parser')

In [163]:
df = pd.DataFrame(columns=['NAME', 'PRICE', 'IMAGE URL', 'RATING'])

In [164]:
image_all = soup.find_all('img', class_="s-image")

In [165]:
name = []
image_url = []
for i in image_all:
    image_url.append(i.get('src'))
    name.append(i.get('alt'))

In [166]:
#Name and URL
#print(image_url)
#name

In [167]:
rating_all = soup.find_all('div', class_="a-section a-spacing-medium")

In [168]:
data_1 = {}

In [169]:
for i in range(1,len(rating_all)+1):
    data1 = []
    data = rating_all[i-1].text.split("\n")
    for j in data:
        #print(j)
        if j in ['Best seller', 'in Electronics', '']:
            continue
        data1.append(j)
    data_1[i] = data1

In [170]:
#For mobile phones whose rating are not present we are hard coding it as 0 out of 5 stars
for i in data_1.keys():
    for j in data_1[i]:
        if data_1[i].index(j) == 1:
            if j.find('out of') == -1:
                data_1[i].insert(1,'0 out of 5 stars')

In [171]:
#For mobiles whose ratings are given, there is a number besides the rating, 
#denoting total number of rating given. Also for some mobiles there are special offers denoted by 'Limited time deal',
#so we are removing these unwanted values to bring relevant values within the index from where we can pick our required data easliy.
for i in data_1.keys():
    for j in data_1[i]:
        if data_1[i].index(j) == 2:
            if j[0] in ['1','2','3','4','5','6','7','8','9']:
                data_1[i].pop(2)
            if j in 'Limited time deal':
                data_1[i].pop(2)

In [172]:
name = []
price = []
rating = []
for i in data_1.keys():
    name.append(data_1[i][0])
    price.append(data_1[i][2])
    rating.append(data_1[i][1])

In [173]:
df['NAME'] = name
df['PRICE'] = price
df['RATING'] = rating
df['IMAGE URL'] = image_url

In [174]:
lnew = list(df['PRICE'])
lcopy = []
for i in lnew:
    lcopy.append(i[:int(len(i)/2)])

In [175]:
df['PRICE'] = lcopy

In [176]:
df

,NAME,PRICE,IMAGE URL,RATING
0,in Smartphones,"Samsung Galaxy M12 (Blue,4GB RAM, 64GB Storage...",https://m.media-amazon.com/images/I/71yYaNztZ0...,0 out of 5 stars
1,"Redmi 9A (Midnight Black, 2GB RAM, 32GB Storag...","₹6,999",https://m.media-amazon.com/images/I/71hDPUM7VP...,4.2 out of 5 stars
2,"Redmi Note 10 (Shadow Black, 6GB RAM, 128GB St...","₹13,999",https://m.media-amazon.com/images/I/71IqJQM2st...,0 out of 5 stars
3,"Redmi 9A (Nature Green, 2GB Ram, 32GB Storage)...","₹6,999",https://m.media-amazon.com/images/I/71hDPUM7VP...,4.2 out of 5 stars
4,"Redmi 9 (Sky Blue, 4GB RAM, 64GB Storage)","₹8,799",https://m.media-amazon.com/images/I/71A9Vo1Bat...,4.1 out of 5 stars
5,"Redmi 9A (Sea Blue, 2GB Ram, 32GB Storage) | 2...","₹6,999",https://m.media-amazon.com/images/I/71hDPUM7VP...,4.2 out of 5 stars
6,"Samsung Galaxy M12 (Black,4GB RAM, 64GB Storag...","₹10,999",https://m.media-amazon.com/images/I/714QWDxXgN...,5.0 out of 5 stars
7,"Redmi Note 10 Pro Max (Glacial Blue, 6GB RAM, ...","₹19,999",https://m.media-amazon.com/images/I/719iIpuMQb...,0 out of 5 stars
8,"Samsung Galaxy M12 (Blue,6GB RAM, 128GB Storag...","₹13,499",https://m.media-amazon.com/images/I/71yYaNztZ0...,5.0 out of 5 stars
9,"Redmi Note 10 (Frost White, 6GB RAM, 128GB Sto...","₹13,999",https://m.media-amazon.com/images/I/71yNlZ4dVZ...,0 out of 5 stars
10,"Samsung Galaxy M31 (Ocean Blue, 6GB RAM, 128GB...",Limited,https://m.media-amazon.com/images/I/71-Su4Wr0H...,4.2 out of 5 stars
11,"Redmi Note 10 (Aqua Green, 6GB RAM, 128GB Stor...","₹13,999",https://m.media-amazon.com/images/I/71Kmfs0T0B...,0 out of 5 stars
12,"Redmi Note 10 Pro Max (Dark Night, 6GB RAM, 12...","₹19,999",https://m.media-amazon.com/images/I/71KpSRjGKz...,0 out of 5 stars
13,"Redmi Note 10 Pro Max (Vintage Bronze, 6GB RAM...","₹19,999",https://m.media-amazon.com/images/I/71i5BHw4RY...,0 out of 5 stars
14,"Redmi Note 9 (Pebble Grey, 4GB RAM 64GB Storag...","₹10,999",https://m.media-amazon.com/images/I/716tvc8pVE...,4.2 out of 5 stars
15,"Redmi 9 Power (Blazing Blue, 4GB RAM, 64GB Sto...",Limited,https://m.media-amazon.com/images/I/71hEzQGO5q...,4.0 out of 5 stars
16,"Redmi 9 Prime (Space Blue, 4GB RAM, 64GB Stora...","₹9,499",https://m.media-amazon.com/images/I/71TwXw2LQR...,4.2 out of 5 stars
17,"Redmi Note 9 (Aqua Green, 4GB RAM, 64GB Storag...","₹10,999",https://m.media-amazon.com/images/I/716tvc8pVE...,4.2 out of 5 stars
18,"Redmi Note 9 Pro Max (Interstellar Black, 6GB ...",Limited,https://m.media-amazon.com/images/I/71usqWEJle...,4.2 out of 5 stars
19,"Redmi 9A (Nature Green, 3GB Ram, 32GB Storage)...","₹7,499",https://m.media-amazon.com/images/I/71hDPUM7VP...,4.2 out of 5 stars
20,"Redmi 9 (Carbon Black, 4GB RAM, 64GB Storage)","₹8,799",https://m.media-amazon.com/images/I/71A9Vo1Bat...,4.1 out of 5 stars
21,"Samsung Galaxy M12 (Black,6GB RAM, 128GB Stora...","₹13,499",https://m.media-amazon.com/images/I/714QWDxXgN...,5.0 out of 5 stars
22,in Basic Mobiles,Nokia 105 Sing,https://m.media-amazon.com/images/I/31Z2ee9oYQ...,0 out of 5 stars
23,"Redmi Note 9 Shadow Black, 4GB RAM, 64GB Storage","₹10,999",https://m.media-amazon.com/images/I/716tvc8pVE...,4.2 out of 5 stars

Above table was fine till before one-two hours, since webpage refreshes everytime and data format changes everytime, it became like this.

# 8. Write a python program to extract information about the local weather from the National Weather Service website of USA, https://www.weather.gov/ for the city, San Francisco. You need to extract data about 7 day extended forecast display for the city. The data should include period, short description, temperature and description.

In [177]:
page = rq.get('https://forecast.weather.gov/MapClick.php?textField1=37.78&textField2=-122.42#.YFctFK8zbIW')
page

In [178]:
soup = bs(page.content, 'html.parser')

In [179]:
df = pd.DataFrame(columns=['PERIOD', 'TEMPERATURE', 'DECRIPTION'])

In [180]:
all_period = soup.find_all('div', class_='col-sm-2 forecast-label')
all_detail = soup.find_all('div', class_='col-sm-10 forecast-text')

In [181]:
period = []
detail = []
for i in all_period:
    period.append(i.text)
for i in all_detail:
    detail.append(i.text)

In [182]:
arr1 = []
det = []
for i in detail:
    det.append(i)
    allnum = []
    for j,k in enumerate(i.split(" ")):
        if len(k) > 0:
            if k[0] in ['0','1','2','3','4','5','6','7','8','9',0,1,2,3,4,5,6,7,8,9]:
                if k[-1] == '.':
                    k = k[:-1]
                allnum.append(k)
    arr1.append(allnum[0])

In [183]:
df['PERIOD'] = period
df['TEMPERATURE'] = arr1
df['DECRIPTION'] = det

In [184]:
df

,PERIOD,TEMPERATURE,DECRIPTION
0,Today,63,"Sunny, with a high near 63. Light and variable..."
1,Tonight,46,"Mostly clear, with a low around 46. West wind ..."
2,Monday,63,"Sunny, with a high near 63. Northwest wind 6 t..."
3,Monday Night,47,"Mostly clear, with a low around 47. West north..."
4,Tuesday,67,"Sunny, with a high near 67. North wind 6 to 15..."
5,Tuesday Night,50,"Clear, with a low around 50."
6,Wednesday,67,"Sunny, with a high near 67."
7,Wednesday Night,48,"Partly cloudy, with a low around 48."
8,Thursday,62,"Sunny, with a high near 62."
9,Thursday Night,46,"Mostly clear, with a low around 46."
10,Friday,65,"Sunny, with a high near 65."
11,Friday Night,48,"Clear, with a low around 48."
12,Saturday,68,"Sunny, with a high near 68."